# Personal-only tools — installed in addition to base Brewfile
brew "pandoc"
cask "basictex"

# Apps
cask "iterm2"
cask "brave-browser"
cask "cursor"
cask "claude"
cask "slack"
cask "zoom"
cask "notion"
cask "microsoft-teams"
cask "fathom"
cask "granola"
cask "linearmouse"
cask "docker-desktop"
cask "ollama-app"
cask "raycast"
cask "tableplus"
cask "proxyman"
cask "azure-cli"

# Cursor extensions (VS Code compatible)
vscode "anthropic.claude-code"
vscode "ms-python.python"
vscode "charliermarsh.ruff"
vscode "eamodio.gitlens"
vscode "ms-toolsai.jupyter"
vscode "ms-python.debugpy"
# Note: remote-ssh and remote-containers must be installed manually in Cursor
# (Microsoft proprietary — not tracked correctly by brew bundle with Cursor)
vscode "ms-azuretools.vscode-docker"
vscode "usernamehw.errorlens"
vscode "redhat.vscode-yaml"
vscode "humao.rest-client"

