# CLI tools
brew "node"
brew "uv"
brew "neonctl"
brew "gh"
brew "ripgrep"
brew "fzf"
brew "bat"
brew "eza"
brew "fd"
brew "jq"
brew "delta"
brew "lazygit"
brew "htop"

# Apps
cask "iterm2"
cask "brave-browser"
cask "cursor"
cask "claude"
cask "slack"
cask "zoom"
cask "notion"
cask "microsoft-teams"
cask "fathom"
cask "granola"
cask "linearmouse"
cask "docker"
cask "ollama"
cask "raycast"

# Cursor extensions (VS Code compatible)
vscode "anthropic.claude-code"
vscode "ms-python.python"
vscode "charliermarsh.ruff"
vscode "eamodio.gitlens"
