# Admin work-machine install - admin-only shared apps.
# Run Brewfile before this for shared CLI tools, then Brewfile.user for per-user tools.

# Apps
cask "iterm2"
cask "brave-browser"
cask "cursor"
cask "claude"
cask "slack"
cask "zoom"
cask "notion"
cask "microsoft-teams"
cask "fathom"
cask "granola"
cask "linearmouse"
cask "docker-desktop"
cask "ollama-app"
cask "raycast"
cask "tableplus"
cask "proxyman"
brew "azure-cli"
