# CLI tools
brew "nvm"
brew "pyenv"
# Python build deps so pyenv can compile CPython from source
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "xz"
brew "zlib"
brew "uv"
brew "neonctl"
brew "gh"
brew "ripgrep"
brew "fzf"
brew "bat"
brew "eza"
brew "fd"
brew "jq"
brew "delta"
brew "lazygit"
brew "htop"
brew "pandoc"
cask "basictex"
